#include <stdio.h>
int main() {
	//IEEE 754规定
	//对于32为的存储，最高的一位是符号位S(是正数就是0，负数就是1)，接着的8位是指数E,剩下23位为有效数字M
	int a = 7;
	//a的二进制数列00000000000000000000000000000101;
	float* p = (float*)&a;//将a的值以浮点数的形式存储在p里
	//0 00000000 00000000000000000000101
	//其中S = 0,E为全0的时候，M前面不会补1，而是直接还原成0，所以M = 0.00000000000000000000101 
	//E全为0的时候，对于32为的浮点数，1-127为真实值，所以E = -126
	printf("%d\n", a);//a是整数类型，以整数形式打印，这里会打印8

	//因为S = 0,E =-126;M = 0.00000000000000000000101
    //所以*p的值为+ 0.00000000000000000000101 * 2^-126,是一个接近于0的数 
	printf("%f\n", *p);
	*p = 7.0; //将a改为浮点数7.0
    //7的二进制数列为111.0
	//+ 1.11*2^2
	//s=0 e+127 =129 = 10000001 m=1.11
	//0 10000001 11000000000000000000000 = 1,088,421,888(以%d整数打印)
	printf("%d\n", a);
	//*p是浮点数，用%f打印就是7.0
	printf("%f\n", *p);

	float b = 5.5;
	//二进制数列为101.1
	// 101最右边的1的权重是2^0的权重是2^1,最左边的1是2^2,所以小数点后的0.5是2^-1
	// 所以b的二进制数列为101.1
	// 101.1 写成二进制1.011*2^2
	// s=0,e+127 = 129=10000001,m=1.011
	// 0 10000001 01100000000000000000000
	// 写成十六进制就是0100 0000 1011 0000 0000 0000 0000 0000 0000 = 0x40 b0 00 00
	//因为c语言在内存中是小端存储，也就是倒着存变成 00 00 b0 40
	//如果b = 5.6，其二进制数列的小数点后面的数可能精度会丢失，因为2^-2是0.25，-3次方是0.125，很难精准匹配到0.6
	//如果E为全1，且M全为0，e=255-127=128则其二进制数列可以写成 2^128,表示正负无穷大的数字
	//对于64的double类型存储，最高的一位是符号位S(是正数就是0，负数就是1)，接着的11位是指数E,剩下52位为有效数字M
}