#include <stdio.h>
#include <string.h>
int main() {
	const char* p = "abcdef"; //p存放的是首元素a的地址
	printf("%d\n", sizeof(p)); //指针4/8
	printf("%d\n", sizeof(p + 1));//p存放的是一个地址，p+1走了一个char类型字节的距离，也还是一个地址
	printf("%d\n", sizeof(*p));//*p取出的就是字符a这个元素，所以是1
	printf("%d\n", sizeof(&p));//&p就是二级指针，存放的是地址，所以是4/8
	printf("%d\n", sizeof(&p + 1));//二级指针+1，跳过了p一个指针的大小就是跳过了4/8个字节，但还是地址，所以是4/8
	printf("%d\n", sizeof(&p[0] + 1));//&p[0]取出的是字符a的地址，+1之后取出的是b的地址，所以是4/8

	printf("%d\n", strlen(p));//strlen遇到\0停止，所以是6
	printf("%d\n", strlen(p + 1));//p这里代表首元素的地址，p+1跳过一个char字节的长度，所以就是第二个元素的地址，所以长度为5

	//printf("%d\n", strlen(*p));
	//*p就是字符a，字符a的ASCII值是61，因为strlen会把61当成地址，并转换为16进制，
	//所以相当于传了个97的地址，但是低地址是不允许用户访问的，所以会报错
	
	//printf("%d\n", strlen(&p));
	//&p就是二级指针，存放的是p的地址，常量字符串abcdef的地址假设是0x400100，&p的地址假设是0x0012ff40
	// strlen会从0x0012ff40这里逐字节往后读取栈上的数据，遇到一个字节值为0才停止，所以是随机值

	//printf("%d\n", strlen(&p + 1));
	//随机值，&p是二级指针，+1之后跳过一个指针的大小，也就是跳过了4/8个字节，往后找到0，才停止
	//&p+1跟&p相差值不能确定

	printf("%d\n", strlen(&p[0] + 1));
	//5,&p[0]就是取出第一个元素的地址，+1之后取出的是b的地址，所以为5
	int a[3][4] = { 0 };

	printf("%d\n", sizeof(a));
	//48 = 3(行）* 4（列） * 4（元素大小）
	printf("%d\n", sizeof(a[0] + 1));
	//a[0]没有单独放在sizeof内部，也没有取地址，a[0]就表示首元素地址
    // a[0]就是第一行这个一维数组的第一个元素的地址，a[0]+1就是第一行的第二个元素的地址
	printf("%d\n", sizeof(a + 1));
	//a虽然是二维数组的地址，但a没有单独放在sizeof内部，也没有取地址
	//a就是表示首元素的地址，也就是第一行的一维数组的地址，a+1就是表示第二行数组的地址
	printf("%d\n", sizeof(&a[0] + 1));
	//&a[0]就是取出了第一行的一维数组的地址，&a[0]+1就是第二行一维数组的地址，跟a+1写法不一样，但结果一样
	printf("%d\n", sizeof(a[3]));
	//a[3]就是第四行一维数组的地址，如果存在的话就是16，而sizeof是去分析a[3]的类型，不会去访问a[3]


	return 0;
}