#include <stdio.h>
struct Test 
{
	int Num;
	char* pcName;
	short sDate;
	char cha[2];
	short sBa[4];
}*p = (struct Test*)0x100000;
//已知在32位环境下，结构体Test类型的变量大小是20个字节
int main() {
	printf("%p\n", p + 0x1);//p+0x1相当于p+1，p是结构体指针，p+1相当于跳过了一个结构体变量大小为20个字节的距离，20转换十六进制就是0x00014，所以会打印0x100014
	printf("%p\n", (unsigned long)p + 0x1);//unsigned long把p的地址看做一个无符号整形，相当于把0x10000看做了10进制的值1,048,576，加1之后就是1,048,577，打印为地址就是0x100001
	printf("%p\n", (unsigned int*)p + 0x1);//unsigned int*强制把p转换为整形指针，p+0x1相当于p+1，p+1相当于跳过了一个整形大小为4个字节的距离，4转换为十六进制就是0x00004，所以结果是0x100004
	
	int a[4] = { 1,2,3,4};
	//&a就是得到了整个数组的起始地址，是个数组指针，类型是int（*）[4],加1之后就是跳过了一个数组也就是4个整形大小的距离
	int* ptr1 = (int*)(&a + 1);
	//a代表首元素地址，假设地址是0x0012ff40，强制转换为整形之后加一并转换为整形指针就是0x0012ff41
	// 因为vs是小端存储，所以整形1的存放是这样的 00 00 00 01(低地址存低位）
	//所以数组中元素的地址存放是这样的(小端存储)
	//（低地址）01 00 00 00 02 00 00 00 03 00 00 00 04 00 00 00(高地址）
	//01的地址是0x0012ff40，而地址0x0012ff41就是01之后的00,把从这个00往后4以整形大小为4个字节的长度存入整形指针变量ptr2
	//所以解引用之后就是往后访问一个整形，也就是00 00 00 02
	int* ptr2 = (int*)((int)a + 1);
	
	printf("%x,%x\n", ptr1[-1],*ptr2);
	//ptr1[-1]相当于*(ptr1 -1),ptr1-1相当于找到了数组的4元素的地址，解引用后就是找到了元素4，转换为十六进制就是0x000004
	//*ptr2打印的时候要拿出内存的值，要把00 00 00 02拿出来要反着拿，所以就是02 00 00 00，所以结果是0x2000000

	int na[5][5];
	//na的内存是这样的□□□□□ □□□□□ □□□□□ □□□□□ □□□□□ ->na的类型是int (*)[5]
	int (*p)[4];//p的类型是int (*)[4]
	p = (int(*)[4])na; //如果要将一个类型是int(*)[5]赋值给int (*)[4]，编译器会报警告，但还是能赋值过去,但在vs2026会报错，所以这里将na的类型强制类型转换为int (*)[4]
	printf("%p,%d\n", &p[4][2] - &na[4][2], &p[4][2] - &na[4][2]);
	//□□□□□ □□□□□ □□□□□ □□□□□ □□?□□其中?就是na[4][2]
	//p[4][2]相当于是*（*（p+4）+2），而在解引用的时候p+1就会向后访问int (*)[4]的也就是4个整形元素的大小
	//也就是p+1相当于（□□□□）? □□□□□ □□□□□ □□□□□ □□□□□跳过了前面四个□，也就是四个整形大小的长度，指向了?的地址
	//所以&p[4][2]相当于找到了□□□□□ □□□□□ □□□□□ □□□?□ □□□□□这里
	// □□□□□ □□□□□ □□□□□ □□□?□ □□?□□所以两个的相差位置是这样的
	//而 &p[4][2] - &na[4][2]相当于是指针减指针，返回的是两个指针之间的元素个数，也就是4个元素，又因为&p[4][2]是低地址，&na[4][2]是高地址，所以返回是一个负4
	//而打印%p的时候是个无符号数
	// -4的二进制位是这样的
	//10000000000000000000000000000100 原码
	//11111111111111111111111111111011 反码
	//11111111111111111111111111111100 补码（因为内存中存储的是补码，地址是没有原反补的概念的，打印%p的时候不会将补码转换为原码，所以将补码这个二进制数的结果打印出来就是FFFF FFFC


	const char* arr[] = { "work","at","alibaba" };
	//arr里存放了work，at,alibaba这三个char*的变量
	const char** pa = arr;
	//pa放了的是首元素地址
	pa++;
	//pa加加之后跳了个char*的字节大小的长度，后找到了第二个元素的地址
	//*pa之后找到了存放at的中的a的地址，而%s打印时会根据地址往后打印，直到遇到字符串结束符 '\0' 才停止。
	printf("%s\n", *pa);

	const char* c[] = { "ENTER","NEW","POINT","FIRST" };
	const char** cp[] = { c + 3,c + 2,c + 1,c };
	const char*** cpp = cp;
	printf("%s\n", **++cpp);
	//++cpp指向了cp[1]的地址，第一个*解引用之后就是得到cp里面的值c+2，第二个*解引用就变成了*（c+2），所以结果是point
	printf("%s\n", *-- * ++cpp + 3);
	//前置 ++、前置 --、解引用 都是同优先级，右结合，从右往左算。
	//首先cpp因为上面的printf中的++cpp，所以cpp已经指向了cp[1]的地址,这里的printf再++cpp后指向了cp[2],第一个解引用之后就是取出里面的值c+1
	//--*++cpp，类似于int a =10；int*p =&a；（*p）++，所以会把c+1的值修改成c，在第二个解引用之后就是找到了c[0]，也就是ENTER的首地址E
	//因为c是char类型的，*表示c是个指针，c[0]+3就是向后移动三个字节，找到了ER
	printf("%s\n", *cpp[-2] + 3);
	//*cpp[-2] = *(*(cpp-2)),因为上面cpp自增之后已经指向了cp[2]的地址，cpp-2就是cpp[0]，解引用之后就是得到了c+3这个值，然后对c+3这个值解引用
	//得到了c[3]的值，+3走3个char字节，所以打印ST
	printf("%s\n", cpp[-1][-1] + 1);
	//CPP指向的是cp[2],然后cpp[-1][-1]相当于*（*（cpp-1））-1），cpp-1找到cp[1]的地址，解引用之后找到了cp[1]的值c+2
	//*（c+2-1）就是*（c+1），而c+1就是NEW的首元素地址，解引用后获得了N，+1就是EW，因为%s直到遇到字符串结束符 '\0' 才停止
	return 0;
}